taylor-cone-jet-EHD/multi-stage-jet/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    domainWall
    {
        type            pressureInletOutletVelocity;
        value           uniform (0.0 0 0);
    }
    domainWall.2
    {
        type            pressureInletOutletVelocity;
        value           uniform (0.0 0 0);
    }

    floor
    {
        type           noSlip;
    }
    floor2
    {
        type           noSlip;
    }
    topWall
    {
        type            pressureInletOutletVelocity;
        value           uniform (0.0 0 0);
    }
    axis
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
		value			uniform (0 -13.3e-3 0);
    }
    electWall
    {
        type           noSlip;
    }
	out
    {
        type            pressureInletOutletVelocity;
        value           uniform (0.0 0 0);
    }
    wedge_pos
    {
        type            wedge;
    }
    wedge_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
