taylor-cone-jet-EHD/multi-stage-jet/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    domainWall
    {
        type            totalPressure;
        p0              uniform 0;
    }
    domainWall.2
    {
        type            totalPressure;
        p0              uniform 0;
    }

    floor
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    floor2
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    axis
    {
        type            empty;
    }
    inlet
    {
        type            zeroGradient;
    }
    topWall
    {
        type            totalPressure;
        p0              uniform 0;
    }
    electWall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
	out
    {
        type            totalPressure;
        p0              uniform 0;
    }
    wedge_pos
    {
        type            wedge;
    }
    wedge_neg
    {
        type            wedge;
    }
	
	
}


// ************************************************************************* //
