taylor-cone-jet-EHD/multi-stage-jet/0.org/rhoE
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      gamma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 1 0 0 1 0];

internalField   uniform 0;

boundaryField
{
    domainWall
    {
		type			zeroGradient;
    }
    domainWall.2
    {
		type			zeroGradient;
    }

    floor
    {
        type            zeroGradient;
    }
	floor2
    {
        type            zeroGradient;
    }
    axis
    {
        type            empty;
    }
    inlet
    {
		type			zeroGradient;
    }
    topWall
    {
        type            zeroGradient;
    }
    electWall
    {
        type            zeroGradient;
    }
	out
	{
        type            zeroGradient;

    }
    wedge_pos
    {
        type            wedge;
    }
    wedge_neg
    {
        type            wedge;
    }
}

// ************************************************************************* //
